---
kind: other
id: Properties.T:Autodesk.Revit.DB.DirectContext3D.VertexFormat
source: html/ca65b718-d2ec-4479-2fb1-35a52e71701c.htm
---
# VertexFormat Properties

Specifies whether the .NET object represents a valid Revit entity.